app/views/teams/index.html.erb


<% if Team.find_by_user_id(current_user.id) == nil %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = 1 LIMIT 1

  <% team = Team.find_by_user_id(current_user.id) %><br/>
  <% team.representatives.each do |rep| %>
---
SELECT "representatives".* FROM "representatives" WHERE "representatives"."team_id" = 1