app/controllers/teams_controller.rb

INSERT INTO "teams" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 13 Aug 2012 22:04:17 UTC +00:00], ["name", nil], ["updated_at", Mon, 13 Aug 2012 22:04:17 UTC +00:00], ["user_id", nil]]
---
  def create
    @team = Team.new(params[:team])
    @team.user_id = current_user.id
    if @team.save